bdring/Grbl_Esp32/Grbl_Esp32/src/WebUI/WebServer.cpp
        //need to be there even no authentication to say to UI no authentication
        _webserver->on("/login", HTTP_ANY, handle_login);

        //web commands
        _webserver->on("/command", HTTP_ANY, handle_web_command);
        _webserver->on("/command_silent", HTTP_ANY, handle_web_command_silent);

        //SPIFFS
        _webserver->on("/files", HTTP_ANY, handleFileList, SPIFFSFileupload);

        //web update
        _webserver->on("/updatefw", HTTP_ANY, handleUpdate, WebUpdateUpload);

#    ifdef ENABLE_SD_CARD
        //Direct SD management
        _webserver->on("/upload", HTTP_ANY, handle_direct_SDFileList, SDFile_direct_upload);
        //_webserver->on("/SD", HTTP_ANY, handle_SDCARD);
#    endif

#    ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode() == WIFI_AP) {
            // if DNSServer is started with "*" for domain name, it will reply with
            // provided IP to all DNS request
            dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
            grbl_send(CLIENT_ALL, "[MSG:Captive Portal Started]\r\n");
            _webserver->on("/generate_204", HTTP_ANY, handle_root);
            _webserver->on("/gconnectivitycheck.gstatic.com", HTTP_ANY, handle_root);
            //do not forget the / at the end
            _webserver->on("/fwlink/", HTTP_ANY, handle_root);
        }
#    endif

#    ifdef ENABLE_SSDP
        //SSDP service presentation
        if (WiFi.getMode() == WIFI_STA) {
            _webserver->on("/description.xml", HTTP_GET, handle_SSDP);
            //Add specific for SSDP
            SSDP.setSchemaURL("description.xml");
            SSDP.setHTTPPort(_port);
            SSDP.setName(wifi_config.Hostname());
            SSDP.setURL("/");
            SSDP.setDeviceType("upnp:rootdevice");
            /*Any customization could be here
        SSDP.setModelName (ESP32_MODEL_NAME);
        SSDP.setModelURL (ESP32_MODEL_URL);
        SSDP.setModelNumber (ESP_MODEL_NUMBER);
        SSDP.setManufacturer (ESP_MANUFACTURER_NAME);
        SSDP.setManufacturerURL (ESP_MANUFACTURER_URL);
        */

            //Start SSDP
            grbl_send(CLIENT_ALL, "[MSG:SSDP Started]\r\n");
            SSDP.begin();
        }
#    endif
        grbl_send(CLIENT_ALL, "[MSG:HTTP Started]\r\n");
        //start webserver
        _webserver->begin();
#    ifdef ENABLE_MDNS
        //add mDNS
        if (WiFi.getMode() == WIFI_STA) {
            MDNS.addService("http", "tcp", _port);
        }
#    endif
        _setupdone = true;
        return no_error;
    }

    void Web_Server::end() {
        _setupdone = false;
#    ifdef ENABLE_SSDP
        SSDP.end();
#    endif  //ENABLE_SSDP
#    ifdef ENABLE_MDNS
        //remove mDNS
        mdns_service_remove("_http", "_tcp");
#    endif
        if (_socket_server) {
            delete _socket_server;
            _socket_server = NULL;
        }

        if (_webserver) {
            delete _webserver;
            _webserver = NULL;
        }

#    ifdef ENABLE_AUTHENTICATION
        while (_head) {
            AuthenticationIP* current = _head;
            _head                     = _head->_next;
            delete current;
        }
        _nb_ip = 0;
#    endif
    }

    //Root of Webserver/////////////////////////////////////////////////////

    void Web_Server::handle_root() {
        String path        = "/index.html";
        String contentType = getContentType(path);
        String pathWithGz  = path + ".gz";
        //if have a index.html or gzip version this is default root page
        if ((SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) && !_webserver->hasArg("forcefallback") &&
            _webserver->arg("forcefallback") != "yes") {
            if (SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }

            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
            return;
        }

        //if no lets launch the default content
        _webserver->sendHeader("Content-Encoding", "gzip");
        _webserver->send_P(200, "text/html", PAGE_NOFILES, PAGE_NOFILES_SIZE);
    }

    //Handle not registred path on SPIFFS neither SD ///////////////////////
    void Web_Server::handle_not_found() {
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST) {
            _webserver->sendContent_P("HTTP/1.1 301 OK\r\nLocation: /\r\nCache-Control: no-cache\r\n\r\n");
            //_webserver->client().stop();
            return;
        }

        bool   page_not_found = false;
        String path           = _webserver->urlDecode(_webserver->uri());
        String contentType    = getContentType(path);
        String pathWithGz     = path + ".gz";

#    ifdef ENABLE_SD_CARD
        if ((path.substring(0, 4) == "/SD/")) {
            //remove /SD
            path = path.substring(3);
            if (SDState::Idle != get_sd_state(true)) {
                String content = "cannot open: ";
                content += path + ", SD is not available.";

                _webserver->send(500, "text/plain", content);
            }
            if (SD.exists(pathWithGz) || SD.exists(path)) {
                set_sd_state(SDState::BusyUploading);
                if (SD.exists(pathWithGz)) {
                    path = pathWithGz;
                }
                File datafile = SD.open(path);
                if (datafile) {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    size_t totalFileSize = datafile.size();
                    size_t i             = 0;
                    bool   done          = false;
                    _webserver->setContentLength(totalFileSize);
                    _webserver->send(200, contentType, "");
                    uint8_t buf[1024];
                    while (!done) {
                        vTaskDelay(1 / portTICK_RATE_MS);
                        int v = datafile.read(buf, 1024);
                        if ((v == -1) || (v == 0)) {
                            done = true;
                        } else {
                            _webserver->client().write(buf, 1024);
                            i += v;
                        }

                        if (i >= totalFileSize) {
                            done = true;
                        }
                    }
                    datafile.close();
                    if (i != totalFileSize) {
                        //error: TBD
                    }
                    set_sd_state(SDState::Idle);
                    return;
                }
                set_sd_state(SDState::Idle);
            }
            String content = "cannot find ";
            content += path;
            _webserver->send(404, "text/plain", content);
            return;
        } else
#    endif
            if (SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) {
            if (SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }
            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
            return;
        } else {
            page_not_found = true;
        }

