bdring/Grbl_Esp32/Grbl_Esp32/src/WebUI/WebServer.cpp
                    if (SPIFFS.exists(filename)) {
                        SPIFFS.remove(filename);
                    }
                    if (fsUploadFile) {
                        fsUploadFile.close();
                    }
                    String sizeargname = upload.filename + "S";
                    if (_webserver->hasArg(sizeargname)) {
                        uint32_t filesize  = _webserver->arg(sizeargname).toInt();
                        uint32_t freespace = SPIFFS.totalBytes() - SPIFFS.usedBytes();
                        if (filesize > freespace) {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                        }
                    }

                    if (_upload_status != UploadStatusType::FAILED) {
                        //create file
                        fsUploadFile = SPIFFS.open(filename, FILE_WRITE);
                        //check If creation succeed
                        if (fsUploadFile) {
                            //if yes upload is started
                            _upload_status = UploadStatusType::ONGOING;
                        } else {
                            //if no set cancel flag
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_FILE_CREATION, "File creation failed");
                        }
                    }
                    //Upload write
                    //**************
                } else if (upload.status == UPLOAD_FILE_WRITE) {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    //check if file is available and no error
                    if (fsUploadFile && _upload_status == UploadStatusType::ONGOING) {
                        //no error so write post date
                        if (upload.currentSize != fsUploadFile.write(upload.buf, upload.currentSize)) {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                        }
                    } else {
                        //we have a problem set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                    //Upload end
                    //**************
                } else if (upload.status == UPLOAD_FILE_END) {
                    //check if file is still open
                    if (fsUploadFile) {
                        //close it
                        fsUploadFile.close();
                        //check size
                        String sizeargname = upload.filename + "S";
                        fsUploadFile       = SPIFFS.open(filename, FILE_READ);
                        uint32_t filesize  = fsUploadFile.size();
                        fsUploadFile.close();

                        if (_webserver->hasArg(sizeargname) && _webserver->arg(sizeargname) != String(filesize)) {
                            _upload_status = UploadStatusType::FAILED;
                        }

                        if (_upload_status == UploadStatusType::ONGOING) {
                            _upload_status = UploadStatusType::SUCCESSFUL;
                        } else {
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_UPLOAD, "File upload failed");
                        }
                    } else {
                        //we have a problem set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        pushError(ESP_ERROR_FILE_CLOSE, "File close failed");
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                    }
                    //Upload cancelled
                    //**************
                } else {
                    _upload_status = UploadStatusType::FAILED;
                    //pushError(ESP_ERROR_UPLOAD, "File upload failed");
                    return;
                }
            }
        }

        if (_upload_status == UploadStatusType::FAILED) {
            cancelUpload();
            if (SPIFFS.exists(filename)) {
                SPIFFS.remove(filename);
            }
        }
        COMMANDS::wait(0);
    }

    //Web Update handler
    void Web_Server::handleUpdate() {
        AuthenticationLevel auth_level = is_authenticated();
        if (auth_level != AuthenticationLevel::LEVEL_ADMIN) {
            _upload_status = UploadStatusType::NONE;
            _webserver->send(403, "text/plain", "Not allowed, log in first!\n");
            return;
        }

        dontCache();
        sendStatus(200, String(int32_t(uint8_t(_upload_status))).c_str(), NULL, NULL);

        //if success restart
        if (_upload_status == UploadStatusType::SUCCESSFUL) {
            COMMANDS::wait(1000);
            COMMANDS::restart_ESP();
        } else {
            _upload_status = UploadStatusType::NONE;
        }
    }

    //File upload for Web update
    void Web_Server::WebUpdateUpload() {
        static size_t   last_upload_update;
        static uint32_t maxSketchSpace = 0;

        //only admin can update FW
        if (is_authenticated() != AuthenticationLevel::LEVEL_ADMIN) {
            _upload_status = UploadStatusType::FAILED;
            grbl_send(CLIENT_ALL, "[MSG:Upload rejected]\r\n");
            pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
        } else {
            //get current file ID
            HTTPUpload& upload = _webserver->upload();
            if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START)) {
                //Upload start
                //**************
                if (upload.status == UPLOAD_FILE_START) {
                    grbl_send(CLIENT_ALL, "[MSG:Update Firmware]\r\n");
                    _upload_status     = UploadStatusType::ONGOING;
                    String sizeargname = upload.filename + "S";
                    if (_webserver->hasArg(sizeargname)) {
                        maxSketchSpace = _webserver->arg(sizeargname).toInt();
                    }
                    //check space
                    size_t flashsize = 0;
                    if (esp_ota_get_running_partition()) {
                        const esp_partition_t* partition = esp_ota_get_next_update_partition(NULL);
                        if (partition) {
                            flashsize = partition->size;
                        }
                    }
                    if (flashsize < maxSketchSpace) {
                        pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                    }
                    if (_upload_status != UploadStatusType::FAILED) {
                        last_upload_update = 0;
                        if (!Update.begin()) {  //start with max available size
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                            pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                        } else {
                            grbl_send(CLIENT_ALL, "\n[MSG:Update 0%]\r\n");
                        }
                    }
                    //Upload write
                    //**************
                } else if (upload.status == UPLOAD_FILE_WRITE) {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    //check if no error
                    if (_upload_status == UploadStatusType::ONGOING) {
                        if (((100 * upload.totalSize) / maxSketchSpace) != last_upload_update) {
                            if (maxSketchSpace > 0) {
                                last_upload_update = (100 * upload.totalSize) / maxSketchSpace;
                            } else {
                                last_upload_update = upload.totalSize;
                            }

                            String s = "Update ";
                            s += String(last_upload_update);
                            s += "%";
                            grbl_sendf(CLIENT_ALL, "[MSG:%s]\r\n", s.c_str());
                        }
                        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Update write failed]\r\n");
                            pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                        }
                    }
                    //Upload end
                    //**************
                } else if (upload.status == UPLOAD_FILE_END) {
                    if (Update.end(true)) {  //true to set the size to the current progress
                        //Now Reboot
                        grbl_send(CLIENT_ALL, "[MSG:Update 100%]\r\n");
                        _upload_status = UploadStatusType::SUCCESSFUL;
                    } else {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                        pushError(ESP_ERROR_UPLOAD, "Update upload failed");
                    }
                } else if (upload.status == UPLOAD_FILE_ABORTED) {
                    grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                    _upload_status = UploadStatusType::FAILED;
                    return;
                }
            }
        }

        if (_upload_status == UploadStatusType::FAILED) {
            cancelUpload();
            Update.end();
        }

