bdring/Grbl_Esp32/Grbl_Esp32/src/WebUI/WebServer.cpp
        COMMANDS::wait(0);
    }

#    ifdef ENABLE_SD_CARD

    //Function to delete not empty directory on SD card
    bool Web_Server::deleteRecursive(String path) {
        bool result = true;
        File file   = SD.open(path);
        //failed
        if (!file) {
            return false;
        }
        if (!file.isDirectory()) {
            file.close();
            //return if success or not
            return SD.remove(path);
        }
        file.rewindDirectory();
        while (true) {
            File entry = file.openNextFile();
            if (!entry) {
                break;
            }
            String entryPath = entry.name();
            if (entry.isDirectory()) {
                entry.close();
                if (!deleteRecursive(entryPath)) {
                    result = false;
                }
            } else {
                entry.close();
                if (!SD.remove(entryPath)) {
                    result = false;
                    break;
                }
            }
            COMMANDS::wait(0);  //wdtFeed
        }
        file.close();
        return result ? SD.rmdir(path) : false;
    }

    //direct SD files list//////////////////////////////////////////////////
    void Web_Server::handle_direct_SDFileList() {
        //this is only for admin and user
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST) {
            _upload_status = UploadStatusType::NONE;
            sendStatus(401, "Authentication failed!", NULL, NULL);
            return;
        }

        String path    = "/";
        String sstatus = "Ok";
        if ((_upload_status == UploadStatusType::FAILED) || (_upload_status == UploadStatusType::FAILED)) {
            sstatus        = "Upload failed";
            _upload_status = UploadStatusType::NONE;
        }
        SDState state = get_sd_state(true);
        if (state != SDState::Idle) {
            dontCache();
            sendStatus(200, state == SDState::NotPresent ? "No SD Card" : "Busy", NULL, NULL);
            return;
        }
        set_sd_state(SDState::BusyParsing);

        //get current path
        if (_webserver->hasArg("path")) {
            path += _webserver->arg("path");
        }

        //to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/') {
            path += "/";
        }
        //check if query need some action
        if (_webserver->hasArg("action")) {
            //delete a file
            if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                filename         = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (!SD.exists(filename)) {
                    sstatus = shortname + " does not exist!";
                } else {
                    if (SD.remove(filename)) {
                        sstatus = shortname + " deleted";
                    } else {
                        sstatus = "Cannot deleted ";
                        sstatus += shortname;
                    }
                }
            }
            //delete a directory
            if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + "/" + shortname;
                filename.replace("//", "/");
                if (filename != "/") {
                    if (!SD.exists(filename)) {
                        sstatus = shortname + " does not exist!";
                    } else {
                        if (!deleteRecursive(filename)) {
                            sstatus = "Error deleting: ";
                            sstatus += shortname;
                        } else {
                            sstatus = shortname;
                            sstatus += " deleted";
                        }
                    }
                } else {
                    sstatus = "Cannot delete root";
                }
            }
            //create a directory
            if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                filename         = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (SD.exists(filename)) {
                    sstatus = shortname + " already exists!";
                } else {
                    if (!SD.mkdir(filename)) {
                        sstatus = "Cannot create ";
                        sstatus += shortname;
                    } else {
                        sstatus = shortname + " created";
                    }
                }
            }
        }

        JSONencoder j(false);
        j.begin();

        if (path != "/") {
            path = path.substring(0, path.length() - 1);
        }
        if (path != "/" && !SD.exists(path)) {
            j.member("status", path + " does not exist on SD Card");
        } else {
            j.begin_array("files");
            if (!_webserver->hasArg("dontlist") || !(_webserver->arg("dontlist") == "yes")) {
                File dir = SD.open(path);
                if (!dir.isDirectory()) {
                    dir.close();
                }
                dir.rewindDirectory();
                File entry = dir.openNextFile();
                while (entry) {
                    COMMANDS::wait(1);
                    j.begin_object();
                    String tmpname = entry.name();
                    int    pos     = tmpname.lastIndexOf("/");
                    tmpname        = tmpname.substring(pos + 1);
                    j.member("name", tmpname);
                    j.member("shortname", tmpname);
                    j.member("size", entry.isDirectory() ? "-1" : ESPResponseStream::formatBytes(entry.size()));
                    // Omit the timestamp because Grbl_ESP32 systems rarely have
                    // reliable knowledge of the current date and time, so timestamps
                    // on uploaded files are unlikely to be useful.
                    j.member("datetime", "");
                    j.end_object();
                    entry.close();
                    entry = dir.openNextFile();
                }
                dir.close();
            }
            j.end_array();

            j.member("path", path);
            j.member("status", sstatus);
            j.filesystemStats(SD.totalBytes(), SD.usedBytes());
            j.member("mode", "direct");
        }
        dontCache();
        sendJSON(200, j);
        _upload_status = UploadStatusType::NONE;
        set_sd_state(SDState::Idle);
        SD.end();
    }

    //SD File upload with direct access to SD///////////////////////////////
    void Web_Server::SDFile_direct_upload() {
        static String filename;
        static File   sdUploadFile;
        //this is only for admin and user
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST) {
            _upload_status = UploadStatusType::FAILED;
            sendStatus(401, "Authentication failed!", NULL, NULL);
            pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
        } else {
            //retrieve current file id
            HTTPUpload& upload = _webserver->upload();
            if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START)) {
                //Upload start
                //**************
                if (upload.status == UPLOAD_FILE_START) {
                    _upload_status = UploadStatusType::ONGOING;
                    filename       = upload.filename;
                    //on SD need to add / if not present
                    if (filename[0] != '/') {
                        filename = "/" + upload.filename;
                    }
                    //check if SD Card is available
                    if (get_sd_state(true) != SDState::Idle) {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                        pushError(ESP_ERROR_UPLOAD_CANCELLED, "Upload cancelled");

                    } else {
                        set_sd_state(SDState::BusyUploading);
                        //delete file on SD Card if already present
                        if (SD.exists(filename)) {
                            SD.remove(filename);
                        }
                        String sizeargname = upload.filename + "S";
                        if (_webserver->hasArg(sizeargname)) {
                            uint32_t filesize  = _webserver->arg(sizeargname).toInt();
                            uint64_t freespace = SD.totalBytes() - SD.usedBytes();
                            if (filesize > freespace) {
                                _upload_status = UploadStatusType::FAILED;
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                            }
                        }
                        if (_upload_status != UploadStatusType::FAILED) {
                            //Create file for writing
                            sdUploadFile = SD.open(filename, FILE_WRITE);
                            //check if creation succeed
                            if (!sdUploadFile) {
                                //if creation failed
                                _upload_status = UploadStatusType::FAILED;
                                grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                                pushError(ESP_ERROR_FILE_CREATION, "File creation failed");
                            }
                            //if creation succeed set flag UploadStatusType::ONGOING
                            else {
                                _upload_status = UploadStatusType::ONGOING;
                            }
                        }
                    }
                    //Upload write
                    //**************
                } else if (upload.status == UPLOAD_FILE_WRITE) {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    if (sdUploadFile && (_upload_status == UploadStatusType::ONGOING) && (get_sd_state(false) == SDState::BusyUploading)) {
                        //no error write post data
                        if (upload.currentSize != sdUploadFile.write(upload.buf, upload.currentSize)) {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                        }
                    } else {  //if error set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                    //Upload end
                    //**************
                } else if (upload.status == UPLOAD_FILE_END) {
                    //if file is open close it
                    if (sdUploadFile) {
                        sdUploadFile.close();
                        //TODO Check size
                        String sizeargname = upload.filename + "S";
                        if (_webserver->hasArg(sizeargname)) {
                            uint32_t filesize = 0;
                            sdUploadFile      = SD.open(filename, FILE_READ);
                            filesize          = sdUploadFile.size();
                            sdUploadFile.close();
                            if (_webserver->arg(sizeargname) != String(filesize)) {
                                _upload_status = UploadStatusType::FAILED;
                                pushError(ESP_ERROR_UPLOAD, "File upload mismatch");
                                grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            }
                        }
                    } else {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        pushError(ESP_ERROR_FILE_CLOSE, "File close failed");
                    }
                    if (_upload_status == UploadStatusType::ONGOING) {
                        _upload_status = UploadStatusType::SUCCESSFUL;
                        set_sd_state(SDState::Idle);
                    } else {
                        _upload_status = UploadStatusType::FAILED;
                        pushError(ESP_ERROR_UPLOAD, "Upload error");
                    }

                } else {  //Upload cancelled
                    _upload_status = UploadStatusType::FAILED;
                    set_sd_state(SDState::Idle);
                    grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                    if (sdUploadFile) {
                        sdUploadFile.close();
                    }
                    SD.end();
                    return;
                }
            }
        }
        if (_upload_status == UploadStatusType::FAILED) {
            cancelUpload();
            if (sdUploadFile) {
                sdUploadFile.close();
            }
            if (SD.exists(filename)) {
                SD.remove(filename);
            }
            set_sd_state(SDState::Idle);
        }
        COMMANDS::wait(0);
    }
#    endif

    void Web_Server::handle() {
        static uint32_t timeout = millis();
        COMMANDS::wait(0);
#    ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode() == WIFI_AP) {
            dnsServer.processNextRequest();
        }
#    endif
        if (_webserver) {
            _webserver->handleClient();
        }
        if (_socket_server && _setupdone) {
            _socket_server->loop();
        }
        if ((millis() - timeout) > 10000 && _socket_server) {
            String s = "PING:";
            s += String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout = millis();
        }
    }

    void Web_Server::handle_Websocket_Event(uint8_t num, uint8_t type, uint8_t* payload, size_t length) {
        switch (type) {
            case WStype_DISCONNECTED:
                //USE_SERIAL.printf("[%u] Disconnected!\n", num);
                break;
            case WStype_CONNECTED: {
                IPAddress ip = _socket_server->remoteIP(num);
                //USE_SERIAL.printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
                String s = "CURRENT_ID:" + String(num);
                // send message to client
                _id_connection = num;
                _socket_server->sendTXT(_id_connection, s);
                s = "ACTIVE_ID:" + String(_id_connection);
                _socket_server->broadcastTXT(s);
            } break;
            case WStype_TEXT:
                //USE_SERIAL.printf("[%u] get Text: %s\n", num, payload);

                // send message to client
                // webSocket.sendTXT(num, "message here");

